In [2]:
import pandas as pd
df = pd.read_csv('marks_data.csv')
print(df.head())

   Student_ID             Name  Math  Science  English  Total  \
0           1   Cornell Ousley    58       46       54    110
1           2    Clayton Jonas    93       79       77    120
2           3  Estevan Donovin    28       27       68     56
3           4    Patric Ewbank    81       74       19    106
4           5   Silvie Haylock     1       13       52    136

              Grade
0  Open-architected
1          matrices
2     collaboration
3       Right-sized
4          strategy

In [3]:
df.isna() # Checking NA values

     Student_ID   Name   Math  Science  English  Total  Grade
0         False  False  False    False    False  False  False
1         False  False  False    False    False  False  False
2         False  False  False    False    False  False  False
3         False  False  False    False    False  False  False
4         False  False  False    False    False  False  False
..          ...    ...    ...      ...      ...    ...    ...
995       False  False  False    False    False  False  False
996       False  False  False    False    False  False  False
997       False  False  False    False    False  False  False
998       False  False  False    False    False  False  False
999       False  False  False    False    False  False  False

[1000 rows x 7 columns]

In [4]:
df.isnull() # Checking null values

     Student_ID   Name   Math  Science  English  Total  Grade
0         False  False  False    False    False  False  False
1         False  False  False    False    False  False  False
2         False  False  False    False    False  False  False
3         False  False  False    False    False  False  False
4         False  False  False    False    False  False  False
..          ...    ...    ...      ...      ...    ...    ...
995       False  False  False    False    False  False  False
996       False  False  False    False    False  False  False
997       False  False  False    False    False  False  False
998       False  False  False    False    False  False  False
999       False  False  False    False    False  False  False

[1000 rows x 7 columns]

In [5]:
# calculating total marks by summing each row
df['Total'] = df[['Math', 'Science', 'English']].sum(axis=1)
print(df[['Name','Math', 'Science', 'English', 'Total']].head(10)) # verifying total

               Name  Math  Science  English  Total
0    Cornell Ousley    58       46       54    158
1     Clayton Jonas    93       79       77    249
2   Estevan Donovin    28       27       68    123
3     Patric Ewbank    81       74       19    174
4    Silvie Haylock     1       13       52     66
5      Alvis Breeds    89       67       47    203
6     Orville Pavel    18       17       95    130
7  Marty Broomfield    27       41       60    128
8      Perle Lisett    28       41        4     73
9       Niko Scarce    42       17        1     60

In [9]:
# Function to assign grades
def assign_grade(total):
    if total >= 250:
       return 'A'
    elif total >= 200:
        return 'B'
    elif total >= 150:
        return 'C'
    else:
        return 'D'
assign_grade(90)

'D'

In [10]:
df['Grade'] = df['Total'].apply(assign_grade) # calling the assign grade function
df[['Name','Total', 'Grade']]

                   Name  Total Grade
0        Cornell Ousley    158     C
1         Clayton Jonas    249     B
2       Estevan Donovin    123     D
3         Patric Ewbank    174     C
4        Silvie Haylock     66     D
..                  ...    ...   ...
995        Maia Angliss    207     B
996  Rogers Jedrzejczak    232     B
997        Stern McLewd    140     D
998     Guillaume Lente    183     C
999        Tiffy Kliesl    216     B

[1000 rows x 3 columns]

In [11]:
print(df[['Name','Total', 'Grade']])

                   Name  Total Grade
0        Cornell Ousley    158     C
1         Clayton Jonas    249     B
2       Estevan Donovin    123     D
3         Patric Ewbank    174     C
4        Silvie Haylock     66     D
..                  ...    ...   ...
995        Maia Angliss    207     B
996  Rogers Jedrzejczak    232     B
997        Stern McLewd    140     D
998     Guillaume Lente    183     C
999        Tiffy Kliesl    216     B

[1000 rows x 3 columns]

In [12]:
# Filteration Demo

grade_a_students = df[df['Grade'] == 'A']
print(grade_a_students)

     Student_ID                 Name  Math  Science  English  Total Grade
19           20      Gunar Brounsell    90       95       72    257     A
76           77        Murial Myrick    88       95       89    272     A
110         111            Lucy Bann    84       79       90    253     A
159         160    Hobard Parrington    82       83       88    253     A
208         209          Arni Royans    70       89       93    252     A
228         229           Natty Peat    81       98       91    270     A
293         294        Riley Lemmens    80       77       96    253     A
379         380  Brennen Riccardelli    91       98       77    266     A
431         432      Gaspard Warlock    92       66       97    255     A
438         439        Andris Mephan    98       97       65    260     A
678         679          Xenos Skyrm    75       99       76    250     A
706         707          Mace Fryett    98       63      100    261     A
761         762          Carla Bolan    74       86       91    251     A
774         775        Elinore Lacky    82      100      100    282     A
836         837         Anna Fobidge    97       91       78    266     A
874         875       Mallory O'dell    90       96       95    281     A
877         878         Martita Eloy    70       98       88    256     A

In [13]:
grade_b_students = df[df['Grade'] == 'B']
print('No. of students secured grade B: ',len(grade_a_students))

No. of students secured grade B:  17

In [14]:
print('Totals no. of students failed: ', len(df[df['Grade'] == 'D']))

Totals no. of students failed:  496

In [15]:
math_max = max(df['Math'])
print(math_max)

100

In [16]:
print(df[df['Math'] == math_max])

     Student_ID                  Name  Math  Science  English  Total Grade
107         108      Darcee Eccleston   100       87       44    231     B
195         196        Maurizio Nesey   100       39        7    146     D
247         248       Oralla Clouston   100       38       26    164     C
375         376       Torrance Proske   100        6       15    121     D
436         437          Alika Romain   100       16       77    193     C
609         610         Emile Waldren   100       76       62    238     B
635         636          Malory Anton   100        6       21    127     D
660         661     Dominic Eastridge   100       29       21    150     C
682         683  Marguerite Gallaccio   100        4       50    154     C
686         687           Reyna Still   100       16       87    203     B

In [17]:
# Saving the data to CSV
df.to_csv("new_marks_data.csv", index = False)
print("data saved successfully!")

data saved successfully!